#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-cloudfront.aws_acm_certificate_validation.cert_shunkakinoki_com must be replaced
-/+ resource "aws_acm_certificate_validation" "cert_shunkakinoki_com" {
        certificate_arn         = "arn:aws:acm:us-east-1:589845989135:certificate/aa531ce6-8af7-4dca-ac08-4a9d708bf6c6"
      ~ id                      = "2019-12-18 12:31:29 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_7d70e7567830ded68ef35de5b0f509bd.shunkakinoki.com",
        ] -> (known after apply) # forces replacement
    }

  # module.aws-cloudfront.aws_route53_record.cert_validation_shunkakinoki_com will be created
  + resource "aws_route53_record" "cert_validation_shunkakinoki_com" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_7d70e7567830ded68ef35de5b0f509bd.shunkakinoki.com"
      + records         = [
          + "_33628ef038fed6432842b8398d51f169.tljzshvwok.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z19V0BNFYY29A"
    }

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-03-03T07:59:33.670+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "9ZjLnjzehmaucV1rk6qMTg2S6a0koKPnq+07RQvmDOY=" -> (known after apply)
        source_code_size               = 914
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_CHANNEL_NAME" = "aws-cost"
                "SLACK_POST_URL"     = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost_log will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost_log" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost-log"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost-log"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log/invocations"
      ~ last_modified                  = "2020-03-03T07:59:33.345+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "9ZjLnjzehmaucV1rk6qMTg2S6a0koKPnq+07RQvmDOY=" -> (known after apply)
        source_code_size               = 914
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_CHANNEL_NAME" = "aws-cost-log"
                "SLACK_POST_URL"     = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-route-53.aws_route53_record.k8s_shunkakinoki_com_CNAME will be created
  + resource "aws_route53_record" "k8s_shunkakinoki_com_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "k8s.shunkakinoki.com"
      + records         = [
          + "usw1.kubesail.io",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z19V0BNFYY29A"
    }

  # module.aws-route-53.aws_route53_record.k8s_shunkakinoki_com_NS will be created
  + resource "aws_route53_record" "k8s_shunkakinoki_com_NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "k8s.$paws_route53_zone.shunkakinoki.name}"
      + records         = [
          + "ns-1051.awsdns-03.org",
          + "ns-1701.awsdns-20.co.uk",
          + "ns-292.awsdns-36.com",
          + "ns-913.awsdns-50.net",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z19V0BNFYY29A"
    }

  # module.aws-s3-bucket.aws_s3_bucket.k8s_shunkakinoki_com will be created
  + resource "aws_s3_bucket" "k8s_shunkakinoki_com" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "k8s.shunkakinoki.com"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 5 to add, 2 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
